#ifndef INVENTORY_H
#define INVENTORY_H
#include <QString>

// Размеры инвентаря
const int c_int_default_inventory_rows      = 3;
const int c_int_default_inventory_columns   = 3;
/**
  ******************************************************************************
  Класс описывает инвентарь
  ******************************************************************************
*/
class Inventory
{
public:
    /**
      **************************************************************************
      Метод строит на месте предмет с указанным типом type и количеством count
      в заданной ячейке (добавляется новая запись в БД)
      **************************************************************************
    */
    bool emplace_item_to_cell(
            int row,
            int column,
            int type,
            int count = 1);
public:
    /**
      **************************************************************************
      Метод возвращает тип (ключ в БД) предмета в заданной ячейке
      **************************************************************************
    */
    int get_type_for_cell(
            int row,
            int column) const;
public:
    /**
      **************************************************************************
      Метод возвращает путь к изображению предмета, расположенного в
      заданной ячейке, находящемуся в ресурсах
      **************************************************************************
    */
    QString get_image_for_cell(
            int row,
            int column) const;
public:
    /**
      **************************************************************************
      Геттер и Сеттер для количества предметов в заданной ячейке
      **************************************************************************
    */
    int get_count_for_cell(
            int row,
            int column) const;

    bool set_count_for_cell(
            int row,
            int column,
            int count);
public:
    /**
      **************************************************************************
      Проверека на условие отсутсвия предмета в инвентаре в ячейке (row, column)
      **************************************************************************
    */
    bool cell_is_empty(
            int row,
            int column) const;
public:
    /**
      **************************************************************************
      Данные методы удаляют из инвентаря (из БД) предмет расположенный
      в ячейке (row, column) или очищают все таблиу соответственно
      **************************************************************************
    */
    bool clear_cell(int row, int column);
    bool clear_all_cells();
public:
    /**
      **************************************************************************
      Методы возвращают количество строк и столбцов в инвентаре соответственно
      **************************************************************************
    */
    int count_rows() const;
    int count_columns() const;
};

#endif // INVENTORY_H
